#include "login_menus.h"

//进入登录界面
void login_menus(void)
{	
	for(;;)
	{
		system("clear");
		puts("---------------------------------------------------------登录界面------------------------------------------------------------------\n");
		puts("                                                        1、后勤系统登录  ");
		puts("                                                        2、VIP会员登录  ");
		puts("                                                        3、管理系统登录 ");
		puts("                                                        4、返回主界面");
		printf("-----------------------------------------------------------------------------------------------------------------------------------\n");
		switch(get_cmd('1','4'))
		{
		case '1': if(1 == login_logistic())
				  {
					 // 登录成功，进入商品信息界面
					 logistic_login_menu();
				  }
					break;   //后勤人员登录函数，代码段在logistics.c文件中，通过登录后勤人员账号从而进入商品信息界面
		
		case '2': if(1 == login_vip())
				  {
					  exchange();
				  }
				  break;   //VIP登录函数,通过登录vip账号从而进入礼品兑换界面
		
		case '3': if(1 == login_manager())
				{
					// 登录成功，进入子系统
					manager_menu1();	
				}
				break;  //通过登录管理员从而进入管理员界面
		case '4': return;
		}
	}

}

//后勤人员登录
void logistic_login_menu(void)    //后勤人员登录界面
{
 for(;;)
  {
   system("clear");
   puts("---------------------------------------------------------登录界面------------------------------------------------------------------\n");
   puts("                                                        1、修改密码  ");
   puts("                                                        2、商品修改  ");
   puts("                                                        3、  返回");
   printf("-----------------------------------------------------------------------------------------------------------------------------------\n");

   switch(get_cmd('1','3'))
   {
   case '1': logistic_menu1(); break;   //进入后勤人员信息模块
   case '2': next_menu(); break;   //进入商品修改界面
   case '3': return;
   }
  }

}